khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
#ifndef STEPAN_HAL_DMA_STREAMX_H_
#define STEPAN_HAL_DMA_STREAMX_H_

#include "../system/include/cmsis/stm32f4xx.h"

#if 0
void DMA1_Stream6_IRQHandler(void) {  // TX
    if ((DMA1->HISR & DMA_HISR_TCIF6) == DMA_HISR_TCIF6) {
        //GPIOD->ODR ^= GPIO_ODR_OD12;

        _i2c1_mrk_tx = 0x00;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        //while ((DMA1_Stream6->CR) & DMA_SxCR_EN){;}
        DMA1->HIFCR |= DMA_HIFCR_CTCIF6;
        //GPIOD->ODR ^= GPIO_ODR_OD12;

    }
}

void DMA1_Stream5_IRQHandler(void) {  // RX
    if ((DMA1->HISR & DMA_HISR_TCIF5) == DMA_HISR_TCIF5) {
        _i2c1_mrk_rx = 0x00;
        _i2c1_mrk_rx_work = 0x01;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        //while ((DMA1_Stream5->CR) & DMA_SxCR_EN){;}
        DMA1->HIFCR |= DMA_HIFCR_CTCIF5;
    }
}

void DMA_init() {
    // Настройка DMA1 на чтение и запись по I2C
    RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;

    // Отключаем DMA, для чтения
    DMA1_Stream5->CR &= ~DMA_SxCR_EN;
    while ((DMA1_Stream5->CR) & DMA_SxCR_EN){;}
    // Настройка контрольных регистров
    // - (0x01 << 25)     - настройка DMA канала, для I2C1_RX
    // - DMA_SxCR_MINC    - Memory INCrement mode
    // - периферия-память
    // - DMA_SxCR_TCIE    - Прерывания по завершению передачи
    DMA1_Stream5->CR = ((0x01 << 25) | DMA_SxCR_MINC | DMA_SxCR_TCIE);

    DMA1->HIFCR |= DMA_HIFCR_CTCIF5;  // Включаем прерывание после успешной передачи передачи
    DMA1_Stream5->PAR = (uint32_t)&I2C1->DR;
    DMA1_Stream5->M0AR = (uint32_t)&_i2c1_data_rx[0];
    NVIC_EnableIRQ(DMA1_Stream5_IRQn);
    NVIC_SetPriority(DMA1_Stream5_IRQn, 2);

    // Отключаем DMA, для записи
    DMA1_Stream6->CR &= ~DMA_SxCR_EN;
    while ((DMA1_Stream6->CR) & DMA_SxCR_EN){;}
    // Настройка контрольных регистров
    // - (0x01 << 25)     - настройка DMA канала, для I2C1_RX
    // - DMA_SxCR_MINC    - Memory INCrement mode
    // - DMA_SxCR_DIR_0   - память-перефирия
    // - DMA_SxCR_TCIE    - Прерывания по завершению передачи
    DMA1_Stream6->CR = ((0x01 << 25) | DMA_SxCR_MINC | DMA_SxCR_DIR_0 | DMA_SxCR_TCIE);

    DMA1->HIFCR |= DMA_HIFCR_CTCIF6;  // Включаем прерывание после успешной передачи передачи
    DMA1_Stream6->PAR = (uint32_t)&I2C1->DR;
    DMA1_Stream6->M0AR = (uint32_t)&_i2c1_data_tx[0];
    NVIC_EnableIRQ(DMA1_Stream6_IRQn);
    NVIC_SetPriority(DMA1_Stream6_IRQn, 3);
}
#endif

/////////////////////////////////////////////////////////////////////////////////////////////////////////////
uint8_t _dmax_irq_status[16] = { 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
                                 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00 };

#define DMAx_IRQ_STATUS_TCIF  0b00000001  // Полная передача
#define DMAx_IRQ_STATUS_HTIF  0b00000010  // Половина передачи
#define DMAx_IRQ_STATUS_TEIF  0b00000100  // Ошибка передачи
#define DMAx_IRQ_STATUS_DMEIF 0b00001000  // Ошибка direct-режима
#define DMAx_IRQ_STATUS_FEIF  0b00010000  // Ошибка FIFO
#define DMAx_IRQ_STATUS_CT    0b10000000  // Массив 1 или 0

void DMA1_Stream0_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF0) == DMA_LISR_TCIF0) {  // Полная передача
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF0;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF0) == DMA_LISR_HTIF0) {  // Половина передачи
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF0;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF0) == DMA_LISR_TEIF0) {  // Ошибка передачи
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF0;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF0) == DMA_LISR_DMEIF0) {  // Ошибка direct-режима
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF0;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF0) == DMA_LISR_FEIF0) {  // Ошибка FIFO
        _dmax_irq_status[0] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream0->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF0;
    }
}

void DMA1_Stream1_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF1) == DMA_LISR_TCIF1) {  // Полная передача
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF1;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF1) == DMA_LISR_HTIF1) {  // Половина передачи
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF1;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF1) == DMA_LISR_TEIF1) {  // Ошибка передачи
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF1;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF1) == DMA_LISR_DMEIF1) {  // Ошибка direct-режима
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF0;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF1) == DMA_LISR_FEIF1) {  // Ошибка FIFO
        _dmax_irq_status[1] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream1->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF1;
    }
}

void DMA1_Stream2_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF2) == DMA_LISR_TCIF2) {  // Полная передача
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF2;
    }

    if ((DMA1->LISR & DMA_LISR_HTIF2) == DMA_LISR_HTIF2) {  // Половина передачи
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF2;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF2) == DMA_LISR_TEIF2) {  // Ошибка передачи
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF2;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF2) == DMA_LISR_DMEIF2) {  // Ошибка direct-режима
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF2;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF2) == DMA_LISR_FEIF2) {  // Ошибка FIFO
        _dmax_irq_status[2] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream2->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF2;
    }
}

void DMA1_Stream3_IRQHandler(void) {
    if ((DMA1->LISR & DMA_LISR_TCIF3) == DMA_LISR_TCIF3) {  // Полная передача
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTCIF3;
    }

