khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
    if ((DMA1->LISR & DMA_LISR_HTIF3) == DMA_LISR_HTIF3) {  // Половина передачи
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CHTIF3;
    }

    if ((DMA1->LISR & DMA_LISR_TEIF3) == DMA_LISR_TEIF3) {  // Ошибка передачи
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CTEIF3;
    }

    if ((DMA1->LISR & DMA_LISR_DMEIF3) == DMA_LISR_DMEIF3) {  // Ошибка direct-режима
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CDMEIF3;
    }

    if ((DMA1->LISR & DMA_LISR_FEIF3) == DMA_LISR_FEIF3) {  // Ошибка FIFO
        _dmax_irq_status[3] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream3->CR &= ~DMA_SxCR_EN;
        DMA1->LIFCR |= DMA_LIFCR_CFEIF3;
    }
}


void DMA1_Stream4_IRQHandler(void) {
    if ((DMA1->HISR & DMA_HISR_TCIF4) == DMA_HISR_TCIF4) {  // Полная передача
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_LIFCR_CTCIF4;
    }

    if ((DMA1->HISR & DMA_HISR_HTIF4) == DMA_HISR_HTIF4) {  // Половина передачи
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CHTIF4;
    }

    if ((DMA1->HISR & DMA_LISR_TEIF4) == DMA_HISR_TEIF4) {  // Ошибка передачи
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTEIF4;
    }

    if ((DMA1->HISR & DMA_HISR_DMEIF4) == DMA_HISR_DMEIF4) {  // Ошибка direct-режима
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CDMEIF4;
    }

    if ((DMA1->HISR & DMA_HISR_FEIF4) == DMA_HISR_FEIF4) {  // Ошибка FIFO
        _dmax_irq_status[4] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream4->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CFEIF4;
    }
}

void DMA1_Stream5_IRQHandler(void) {
    if ((DMA1->HISR & DMA_HISR_TCIF5) == DMA_HISR_TCIF5) {  // Полная передача
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_LIFCR_CTCIF5;
    }

    if ((DMA1->HISR & DMA_HISR_HTIF5) == DMA_HISR_HTIF5) {  // Половина передачи
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CHTIF5;
    }

    if ((DMA1->HISR & DMA_LISR_TEIF5) == DMA_HISR_TEIF5) {  // Ошибка передачи
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTEIF5;
    }

    if ((DMA1->HISR & DMA_HISR_DMEIF5) == DMA_HISR_DMEIF5) {  // Ошибка direct-режима
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CDMEIF5;
    }

    if ((DMA1->HISR & DMA_HISR_FEIF5) == DMA_HISR_FEIF5) {  // Ошибка FIFO
        _dmax_irq_status[5] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CFEIF5;
    }
}

void DMA1_Stream6_IRQHandler(void) {
    if ((DMA1->HISR & DMA_HISR_TCIF6) == DMA_HISR_TCIF6) {  // Полная передача
        _dmax_irq_status[6] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_LIFCR_CTCIF6;
    }

    if ((DMA1->HISR & DMA_HISR_HTIF6) == DMA_HISR_HTIF6) {  // Половина передачи
        _dmax_irq_status[6] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CHTIF4;
    }

    if ((DMA1->HISR & DMA_LISR_TEIF6) == DMA_HISR_TEIF6) {  // Ошибка передачи
        _dmax_irq_status[6] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTEIF4;
    }

    if ((DMA1->HISR & DMA_HISR_DMEIF6) == DMA_HISR_DMEIF6) {  // Ошибка direct-режима
        _dmax_irq_status[6] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CDMEIF6;
    }

    if ((DMA1->HISR & DMA_HISR_FEIF4) == DMA_HISR_FEIF6) {  // Ошибка FIFO
        _dmax_irq_status[6] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CFEIF6;
    }
}

void DMA1_Stream7_IRQHandler(void) {
    if ((DMA1->HISR & DMA_HISR_TCIF7) == DMA_HISR_TCIF7) {  // Полная передача
        _dmax_irq_status[7] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA1_Stream7->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_LIFCR_CTCIF7;
    }

    if ((DMA1->HISR & DMA_HISR_HTIF7) == DMA_HISR_HTIF7) {  // Половина передачи
        _dmax_irq_status[7] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA1_Stream7->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CHTIF7;
    }

    if ((DMA1->HISR & DMA_LISR_TEIF7) == DMA_HISR_TEIF7) {  // Ошибка передачи
        _dmax_irq_status[7] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA1_Stream7->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CTEIF7;
    }

    if ((DMA1->HISR & DMA_HISR_DMEIF7) == DMA_HISR_DMEIF7) {  // Ошибка direct-режима
        _dmax_irq_status[7] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA1_Stream7->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CDMEIF7;
    }

    if ((DMA1->HISR & DMA_HISR_FEIF7) == DMA_HISR_FEIF7) {  // Ошибка FIFO
        _dmax_irq_status[7] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA1_Stream7->CR &= ~DMA_SxCR_EN;
        DMA1->HIFCR |= DMA_HIFCR_CFEIF7;
    }
}

void DMA2_Stream0_IRQHandler(void) {
    if ((DMA2->LISR & DMA_LISR_TCIF0) == DMA_LISR_TCIF0) {  // Полная передача
        _dmax_irq_status[8] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream0->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTCIF0;
    }

    if ((DMA2->LISR & DMA_LISR_HTIF0) == DMA_LISR_HTIF0) {  // Половина передачи
        _dmax_irq_status[8] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream0->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CHTIF0;
    }

    if ((DMA2->LISR & DMA_LISR_TEIF0) == DMA_LISR_TEIF0) {  // Ошибка передачи
        _dmax_irq_status[8] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream0->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTEIF0;
    }

    if ((DMA2->LISR & DMA_LISR_DMEIF0) == DMA_LISR_DMEIF0) {  // Ошибка direct-режима
        _dmax_irq_status[8] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream0->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CDMEIF0;
    }

    if ((DMA2->LISR & DMA_LISR_FEIF0) == DMA_LISR_FEIF0) {  // Ошибка FIFO
        _dmax_irq_status[8] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream0->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CFEIF0;
    }
}

void DMA2_Stream1_IRQHandler(void) {
    if ((DMA2->LISR & DMA_LISR_TCIF1) == DMA_LISR_TCIF1) {  // Полная передача
        _dmax_irq_status[9] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream1->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTCIF1;
    }

    if ((DMA2->LISR & DMA_LISR_HTIF1) == DMA_LISR_HTIF1) {  // Половина передачи
        _dmax_irq_status[9] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream1->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CHTIF1;
    }

    if ((DMA2->LISR & DMA_LISR_TEIF1) == DMA_LISR_TEIF1) {  // Ошибка передачи
        _dmax_irq_status[9] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream1->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTEIF1;
    }

    if ((DMA2->LISR & DMA_LISR_DMEIF1) == DMA_LISR_DMEIF1) {  // Ошибка direct-режима
        _dmax_irq_status[9] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream1->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CDMEIF1;
    }

    if ((DMA2->LISR & DMA_LISR_FEIF1) == DMA_LISR_FEIF1) {  // Ошибка FIFO
        _dmax_irq_status[9] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream1->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CFEIF1;
    }
}

void DMA2_Stream2_IRQHandler(void) {
    if ((DMA2->LISR & DMA_LISR_TCIF2) == DMA_LISR_TCIF2) {  // Полная передача
        _dmax_irq_status[10] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream2->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTCIF2;
    }

