khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
    if ((DMA2->LISR & DMA_LISR_HTIF2) == DMA_LISR_HTIF2) {  // Половина передачи
        _dmax_irq_status[10] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream2->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CHTIF2;
    }

    if ((DMA2->LISR & DMA_LISR_TEIF2) == DMA_LISR_TEIF2) {  // Ошибка передачи
        _dmax_irq_status[10] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream2->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTEIF2;
    }

    if ((DMA2->LISR & DMA_LISR_DMEIF2) == DMA_LISR_DMEIF2) {  // Ошибка direct-режима
        _dmax_irq_status[10] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream2->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CDMEIF2;
    }

    if ((DMA2->LISR & DMA_LISR_FEIF2) == DMA_LISR_FEIF2) {  // Ошибка FIFO
        _dmax_irq_status[10] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream2->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CFEIF2;
    }
}

void DMA2_Stream3_IRQHandler(void) {
    if ((DMA2->LISR & DMA_LISR_TCIF3) == DMA_LISR_TCIF3) {  // Полная передача
        _dmax_irq_status[11] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream3->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTCIF3;
    }

    if ((DMA2->LISR & DMA_LISR_HTIF3) == DMA_LISR_HTIF0) {  // Половина передачи
        _dmax_irq_status[11] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream3->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CHTIF3;
    }

    if ((DMA2->LISR & DMA_LISR_TEIF3) == DMA_LISR_TEIF3) {  // Ошибка передачи
        _dmax_irq_status[11] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream3->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CTEIF3;
    }

    if ((DMA2->LISR & DMA_LISR_DMEIF3) == DMA_LISR_DMEIF3) {  // Ошибка direct-режима
        _dmax_irq_status[11] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream3->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CDMEIF3;
    }

    if ((DMA2->LISR & DMA_LISR_FEIF3) == DMA_LISR_FEIF3) {  // Ошибка FIFO
        _dmax_irq_status[11] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream3->CR &= ~DMA_SxCR_EN;
        DMA2->LIFCR |= DMA_LIFCR_CFEIF3;
    }
}

void DMA2_Stream4_IRQHandler(void) {
    if ((DMA2->HISR & DMA_HISR_TCIF4) == DMA_HISR_TCIF4) {  // Полная передача
        _dmax_irq_status[12] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream4->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_LIFCR_CTCIF4;
    }

    if ((DMA2->HISR & DMA_HISR_HTIF4) == DMA_HISR_HTIF4) {  // Половина передачи
        _dmax_irq_status[12] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream4->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CHTIF4;
    }

    if ((DMA2->HISR & DMA_LISR_TEIF4) == DMA_HISR_TEIF4) {  // Ошибка передачи
        _dmax_irq_status[12] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream4->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CTEIF4;
    }

    if ((DMA2->HISR & DMA_HISR_DMEIF4) == DMA_HISR_DMEIF4) {  // Ошибка direct-режима
        _dmax_irq_status[12] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream4->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CDMEIF4;
    }

    if ((DMA2->HISR & DMA_HISR_FEIF4) == DMA_HISR_FEIF4) {  // Ошибка FIFO
        _dmax_irq_status[12] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream4->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CFEIF4;
    }
}

void DMA2_Stream5_IRQHandler(void) {
    if ((DMA2->HISR & DMA_HISR_TCIF5) == DMA_HISR_TCIF5) {  // Полная передача
        _dmax_irq_status[13] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream5->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_LIFCR_CTCIF5;
    }

    if ((DMA2->HISR & DMA_HISR_HTIF5) == DMA_HISR_HTIF5) {  // Половина передачи
        _dmax_irq_status[13] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream5->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CHTIF5;
    }

    if ((DMA2->HISR & DMA_LISR_TEIF5) == DMA_HISR_TEIF5) {  // Ошибка передачи
        _dmax_irq_status[13] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream5->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CTEIF5;
    }

    if ((DMA2->HISR & DMA_HISR_DMEIF5) == DMA_HISR_DMEIF5) {  // Ошибка direct-режима
        _dmax_irq_status[13] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream5->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CDMEIF5;
    }

    if ((DMA2->HISR & DMA_HISR_FEIF5) == DMA_HISR_FEIF5) {  // Ошибка FIFO
        _dmax_irq_status[13] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream5->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CFEIF5;
    }
}

void DMA2_Stream6_IRQHandler(void) {
    if ((DMA2->HISR & DMA_HISR_TCIF6) == DMA_HISR_TCIF6) {  // Полная передача
        _dmax_irq_status[14] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream6->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_LIFCR_CTCIF6;
    }

    if ((DMA2->HISR & DMA_HISR_HTIF6) == DMA_HISR_HTIF6) {  // Половина передачи
        _dmax_irq_status[14] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream6->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CHTIF4;
    }

    if ((DMA2->HISR & DMA_LISR_TEIF6) == DMA_HISR_TEIF6) {  // Ошибка передачи
        _dmax_irq_status[14] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream6->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CTEIF4;
    }

    if ((DMA2->HISR & DMA_HISR_DMEIF6) == DMA_HISR_DMEIF6) {  // Ошибка direct-режима
        _dmax_irq_status[14] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream6->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CDMEIF6;
    }

    if ((DMA2->HISR & DMA_HISR_FEIF4) == DMA_HISR_FEIF6) {  // Ошибка FIFO
        _dmax_irq_status[14] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream6->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CFEIF6;
    }
}

void DMA2_Stream7_IRQHandler(void) {
    if ((DMA2->HISR & DMA_HISR_TCIF7) == DMA_HISR_TCIF7) {  // Полная передача
        _dmax_irq_status[15] &= ~DMAx_IRQ_STATUS_TCIF;
        DMA2_Stream7->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_LIFCR_CTCIF7;
    }

    if ((DMA2->HISR & DMA_HISR_HTIF7) == DMA_HISR_HTIF7) {  // Половина передачи
        _dmax_irq_status[15] &= ~DMAx_IRQ_STATUS_HTIF;
        DMA2_Stream7->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CHTIF7;
    }

