khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
    if ((DMA2->HISR & DMA_LISR_TEIF7) == DMA_HISR_TEIF7) {  // Ошибка передачи
        _dmax_irq_status[15] &= ~DMAx_IRQ_STATUS_TEIF;
        DMA2_Stream7->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CTEIF7;
    }

    if ((DMA2->HISR & DMA_HISR_DMEIF7) == DMA_HISR_DMEIF7) {  // Ошибка direct-режима
        _dmax_irq_status[15] &= ~DMAx_IRQ_STATUS_DMEIF;
        DMA2_Stream7->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CDMEIF7;
    }

    if ((DMA2->HISR & DMA_HISR_FEIF7) == DMA_HISR_FEIF7) {  // Ошибка FIFO
        _dmax_irq_status[15] &= ~DMAx_IRQ_STATUS_FEIF;
        DMA2_Stream7->CR &= ~DMA_SxCR_EN;
        DMA2->HIFCR |= DMA_HIFCR_CFEIF7;
    }
}

/* P может быть: I2C_TypeDef, SPI_TypeDef, USART_TypeDef
 * A может быть: uint8_t, uint16_t, uint32_t
 * */
template<typename P, typename A>
class SH_DMA_Sx {
    DMA_Stream_TypeDef *_DMA_Sx;
    DMA_TypeDef *_DMA;
    P *_periphery;
    uint32_t _options_cr;
    uint16_t _size;
    uint8_t _priority;
    uint8_t _dma_stream = 0x00;

    void _dmax_init() {
        if ((_DMA_Sx == DMA1_Stream0) || (_DMA_Sx == DMA1_Stream1) || (_DMA_Sx == DMA1_Stream2) ||
            (_DMA_Sx == DMA1_Stream3) || (_DMA_Sx == DMA1_Stream4) || (_DMA_Sx == DMA1_Stream5) ||
            (_DMA_Sx == DMA1_Stream6) || (_DMA_Sx == DMA1_Stream7)) {
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA1EN;
            _DMA = DMA1;
        }

        if ((_DMA_Sx == DMA2_Stream0) || (_DMA_Sx == DMA2_Stream1) || (_DMA_Sx == DMA2_Stream2) ||
            (_DMA_Sx == DMA2_Stream3) || (_DMA_Sx == DMA2_Stream4) || (_DMA_Sx == DMA2_Stream5) ||
            (_DMA_Sx == DMA2_Stream6) || (_DMA_Sx == DMA2_Stream7)) {
            RCC->AHB1ENR |= RCC_AHB1ENR_DMA2EN;
            _DMA = DMA2;
        }
    }

    void _iqr_dma_sx_init(const uint8_t &irq_priority) {
        //// DMA1
        if (_DMA_Sx == DMA1_Stream0) {
            _dma_stream = 0;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CFEIF0);
            NVIC_EnableIRQ(DMA1_Stream0_IRQn);
            NVIC_SetPriority(DMA1_Stream0_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA1_Stream1) {
            _dma_stream = 1;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1);
            NVIC_EnableIRQ(DMA1_Stream1_IRQn);
            NVIC_SetPriority(DMA1_Stream1_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA1_Stream2) {
            _dma_stream = 2;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2);
            NVIC_EnableIRQ(DMA1_Stream2_IRQn);
            NVIC_SetPriority(DMA1_Stream2_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA1_Stream3) {
            _dma_stream = 3;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3);
            NVIC_EnableIRQ(DMA1_Stream3_IRQn);
            NVIC_SetPriority(DMA1_Stream3_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA1_Stream4) {
            _dma_stream = 4;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4);
            NVIC_EnableIRQ(DMA1_Stream4_IRQn);
            NVIC_SetPriority(DMA1_Stream4_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA1_Stream5) {
            _dma_stream = 5;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5);
            NVIC_EnableIRQ(DMA1_Stream5_IRQn);
            NVIC_SetPriority(DMA1_Stream5_IRQn, irq_priority);
        }

        if (_DMA_Sx == DMA1_Stream6) {
            _dma_stream = 6;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6);
            NVIC_EnableIRQ(DMA1_Stream6_IRQn);
            NVIC_SetPriority(DMA1_Stream6_IRQn, irq_priority);
        }

        if (_DMA_Sx == DMA1_Stream7) {
            _dma_stream = 7;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7);
            NVIC_EnableIRQ(DMA1_Stream7_IRQn);
            NVIC_SetPriority(DMA1_Stream7_IRQn, irq_priority);
        }

        //// DMA2
        if (_DMA_Sx == DMA2_Stream0) {
            _dma_stream = 8;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF0 | DMA_LIFCR_CHTIF0 | DMA_LIFCR_CTEIF0 | DMA_LIFCR_CDMEIF0 | DMA_LIFCR_CFEIF0);
            NVIC_EnableIRQ(DMA2_Stream0_IRQn);
            NVIC_SetPriority(DMA2_Stream0_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream1) {
            _dma_stream = 9;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF1 | DMA_LIFCR_CHTIF1 | DMA_LIFCR_CTEIF1 | DMA_LIFCR_CDMEIF1 | DMA_LIFCR_CFEIF1);
            NVIC_EnableIRQ(DMA2_Stream1_IRQn);
            NVIC_SetPriority(DMA2_Stream1_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream2) {
            _dma_stream = 10;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF2 | DMA_LIFCR_CHTIF2 | DMA_LIFCR_CTEIF2 | DMA_LIFCR_CDMEIF2 | DMA_LIFCR_CFEIF2);
            NVIC_EnableIRQ(DMA2_Stream2_IRQn);
            NVIC_SetPriority(DMA2_Stream2_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream3) {
            _dma_stream = 11;
            _DMA->LIFCR |= (DMA_LIFCR_CTCIF3 | DMA_LIFCR_CHTIF3 | DMA_LIFCR_CTEIF3 | DMA_LIFCR_CDMEIF3 | DMA_LIFCR_CFEIF3);
            NVIC_EnableIRQ(DMA2_Stream3_IRQn);
            NVIC_SetPriority(DMA2_Stream3_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream4) {
            _dma_stream = 12;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF4 | DMA_HIFCR_CHTIF4 | DMA_HIFCR_CTEIF4 | DMA_HIFCR_CDMEIF4 | DMA_HIFCR_CFEIF4);
            NVIC_EnableIRQ(DMA2_Stream4_IRQn);
            NVIC_SetPriority(DMA2_Stream4_IRQn, irq_priority);
        }
        
        if (_DMA_Sx == DMA2_Stream5) {
            _dma_stream = 13;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF5 | DMA_HIFCR_CHTIF5 | DMA_HIFCR_CTEIF5 | DMA_HIFCR_CDMEIF5 | DMA_HIFCR_CFEIF5);
            NVIC_EnableIRQ(DMA2_Stream5_IRQn);
            NVIC_SetPriority(DMA2_Stream5_IRQn, irq_priority);
        }

