khosta77/stm32f4_I2C_SSD1306/src/SH_DMA_Sx.h
        if (_DMA_Sx == DMA2_Stream6) {
            _dma_stream = 14;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF6 | DMA_HIFCR_CHTIF6 | DMA_HIFCR_CTEIF6 | DMA_HIFCR_CDMEIF6 | DMA_HIFCR_CFEIF6);
            NVIC_EnableIRQ(DMA2_Stream6_IRQn);
            NVIC_SetPriority(DMA2_Stream6_IRQn, irq_priority);
        }

        if (_DMA_Sx == DMA2_Stream7) {
            _dma_stream = 15;
            _DMA->HIFCR |= (DMA_HIFCR_CTCIF7 | DMA_HIFCR_CHTIF7 | DMA_HIFCR_CTEIF7 | DMA_HIFCR_CDMEIF7 | DMA_HIFCR_CFEIF7);
            NVIC_EnableIRQ(DMA2_Stream7_IRQn);
            NVIC_SetPriority(DMA2_Stream7_IRQn, irq_priority);
        }
    }
public:
    A *_array_0;
    A *_array_1;

    SH_DMA_Sx(DMA_Stream_TypeDef *DMA_Sx,
              P *periphery,
              const uint32_t &options_cr,
              A *array_0,
              A *array_1,
              const uint16_t &size,
              const uint8_t &priority,
              const uint8_t &irq_priority
              ) : _DMA_Sx(DMA_Sx), _periphery(periphery), _options_cr(options_cr),
                  _array_0(array_0), _array_1(array_1), _size(size), _priority(priority)
    {
        uint8_t status = 0x00;

        // Включаем тактирование, назначаем внутреннеию переменную _DMA
        _dmax_init();

        // Отключаем DMA, для настройки
        _DMA_Sx->CR &= ~DMA_SxCR_EN;
        while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}

        // Настройка DMA по документаци
        _DMA_Sx->CR = _options_cr;

        // Задаем потоки передачи/приема
        _DMA_Sx->PAR = (uint32_t)&_periphery->DR;
        _DMA_Sx->M0AR = (uint32_t)&_array_0[0];
        _DMA_Sx->M1AR = (uint32_t)&_array_1[0];
        _DMA_Sx->NDTR = _size;

        // Инициализируем прирывания
        _iqr_dma_sx_init(irq_priority);
    }

    inline uint16_t size() const {
        return _size;
    }
#if 1
static void DMA_Transmit(const uint8_t *pBuffer, uint32_t size) {
    if((NULL != pBuffer) && (size < 16)) {
        while (_i2c1_mrk_tx != 0x00) {;}  // Ждем пока предыдущая передача не закончится
        _i2c1_mrk_tx = 0x01;
        DMA1_Stream6->CR &= ~DMA_SxCR_EN;
        while ((DMA1_Stream6->CR) & DMA_SxCR_EN){;}
        for (uint8_t i = 0; i < size; ++i) {
            _i2c1_data_tx[i] = pBuffer[i];
        }

        DMA1_Stream6->NDTR = size;
        DMA1->HIFCR = DMA_HIFCR_CTCIF6;
        DMA1_Stream6->CR |= DMA_SxCR_EN;
        //while (!(I2C1->SR2 & I2C_SR2_BUSY)){;}

    } else {
        /* Null pointers, do nothing */
    }
}

static void DMA_Receive(const uint8_t size) {
    if(size < 16) {
        while (_i2c1_mrk_rx != 0x00) {;}  // Ждем пока предыдущая передача не закончится
        _i2c1_mrk_rx = 0x01;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
	    while ((DMA1_Stream5->CR) & DMA_SxCR_EN){;}
        DMA1_Stream5->NDTR = size;
        DMA1->HIFCR = DMA_HIFCR_CTCIF5;
        DMA1_Stream5->CR |= DMA_SxCR_EN;
    } else {
        //GPIOD->ODR ^= GPIO_ODR_OD12;
        /* Null pointers, do nothing */
    }
}

static void DMA_Receive_read(uint8_t *pBuffer, uint8_t size) {
    if((NULL != pBuffer) && (size < 16)) {
        while (_i2c1_mrk_rx_work == 0x00) {;}  // Ждем пока предыдущая передача не закончится
        _i2c1_mrk_rx_work = 0x00;
        DMA1_Stream5->CR &= ~DMA_SxCR_EN;
	    while ((DMA1_Stream5->CR) & DMA_SxCR_EN){;}
        for (uint8_t i = 0; i < size; ++i) {
            *(pBuffer + i) = _i2c1_data_rx[i];
        }
    } else {
        //GPIOD->ODR ^= GPIO_ODR_OD12;
        /* Null pointers, do nothing */
    }
}
#endif

private:
    void fuller_array(A *_array, const A *pBuffer) {
        for (uint32_t i = 0; i < _size; ++i) {
            _array[i] = pBuffer[i];
        }
    }

public:
    void dma_transmit(const A *pBuffer) {
        if(pBuffer != nullptr) {
            // Ждем/проверяем пока передача не закончится
            while ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_TCIF) == DMAx_IRQ_STATUS_TCIF) {;}
            
            // Отключаем DMA
            _DMA_Sx->CR &= ~DMA_SxCR_EN;
            while ((_DMA_Sx->CR) & DMA_SxCR_EN){;}

            // Выбираем и заполняем массив
            if ((_dmax_irq_status[_dma_stream] & DMAx_IRQ_STATUS_CT) == DMAx_IRQ_STATUS_CT) {
                _DMA_Sx->CR &= ~DMA_SxCR_CT;
                _dmax_irq_status[_dma_stream] &= ~DMAx_IRQ_STATUS_CT;
                fuller_array(_array_0, pBuffer);
            } else {
                _DMA_Sx->CR |= DMA_SxCR_CT;
                _dmax_irq_status[_dma_stream] |= DMAx_IRQ_STATUS_CT;
                fuller_array(_array_1, pBuffer);
            }

            // Выставляем маркер начала передачи.
            _dmax_irq_status[_dma_stream] |= DMAx_IRQ_STATUS_CT;

            while (stftcb_array_tx_status != 0x00) {;}  // Ждем пока предыдущая передача не закончится
            stftcb_SetAddressWindow(0, count_l, STFTCB_WIDTH, count_l);
            ++count_l;

            SPI_1byte_mode_on();
            STFTCB_DC_ON;
            STFTCB_SPI_DMA_SxCR->CR &= ~DMA_SxCR_EN;
            while ((STFTCB_SPI_DMA_SxCR->CR) & DMA_SxCR_EN){;}

            if (stftcb_array_tx_mxar == 0) {
                STFTCB_SPI_DMA_SxCR->CR &= ~DMA_SxCR_CT;
                stftcb_array_tx_mxar = 0x01;
            } else {
                STFTCB_SPI_DMA_SxCR->CR |= DMA_SxCR_CT;
                stftcb_array_tx_mxar = 0x00;
            }

            stftcb_array_tx_status = 0x11;
            STFTCB_SPI_DMA_SxCR->NDTR = STFTCB_ARRAY_SIZE;
            STFTCB_SPI_DMA_SxCR->CR |= DMA_SxCR_MINC;
            STFTCB_SPI_DMA_SxCR->CR |= DMA_SxCR_EN;

            while (_i2c1_mrk_tx != 0x00) {;}  // Ждем пока предыдущая передача не закончится
            _i2c1_mrk_tx = 0x01;
            DMA1_Stream6->CR &= ~DMA_SxCR_EN;
            while ((DMA1_Stream6->CR) & DMA_SxCR_EN){;}
            for (uint8_t i = 0; i < size; ++i) {
                _i2c1_data_tx[i] = pBuffer[i];
            }

            DMA1_Stream6->NDTR = size;
            DMA1->HIFCR = DMA_HIFCR_CTCIF6;
            DMA1_Stream6->CR |= DMA_SxCR_EN;
            //while (!(I2C1->SR2 & I2C_SR2_BUSY)){;}
        } else {
            /* Null pointers, do nothing */
        }
    }
};

#endif  // STEPAN_HAL_DMA_STREAMX_H_
